t21/Walnut_X/Packages/.cache/Keil.Kinetis_KExx_DFP.1.4.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>Kinetis_KExx_DFP</name>
  <description>Freescale Kinetis KExx Series Device Support</description>

  <releases>
    <release version="1.4.0" date="2016-05-23">
      Added device support for KE14F, KE16F, KE18F devices
      Added device support for KE1xZ series
      Updated MKE1x_P256_2KB_SEC Flash Algorithm.
      Updated KE1xZ Flash Algorithm.
      Reworked section Conditions, Startup.
      Updated documentation.
    </release>
    <release version="1.2.1">
      SRAM range correction.
    </release>
    <release version="1.2.0" date="2014-07-29">
      Added Boards FRDM-KE04Z, FRDM-KE06Z.
      Added examples for FRDM-KE06Z.
    </release>
    <release version="1.1.0" date="2014-06-12">
      Updated SVD files
    </release>
    <release version="1.0.0">
      First Release version of KExx Device Family Pack.
    </release>
  </releases>

  <keywords>
  <!-- keywords for indexing -->
    <keyword>Freescale</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Freescale</keyword>
    <keyword>KExx</keyword>
  </keywords>

  <devices>
    <family Dfamily="KExx Series" Dvendor="Freescale:78">

      <!-- ******************************  KE02  ****************************** -->
      <subFamily DsubFamily="KE02">
        <processor Dcore="Cortex-M0+" DcoreVersion="r0p0"/>
        <book name="Documents/dui0662a_cortex_m0p_r0p0_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
        <description>
The Kinetis KE02 40 MHz MCU family delivers a next-generation solution with enhanced ESD/EMC performance for cost-sensitive, high-reliability device applications used in high electrical noise environments.
 - Offers a cost-effective 32-bit solution featuring low power and high robustness.
 - Includes a powerful array of analog, communication and timing, and control peripherals with varying flash memory size and pin count.
 - Provides a pin-compatible entry point to the Kinetis E series portfolio, as well as pin compatibility with Freescale's 8-bit S08P family.
        </description>

        <!-- ******************************  MKE02Z16xxx2  ****************************** -->
        <device Dname="MKE02Z16xxx2">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="20000000"/>
          <compile header="Device/Include/MKE02Z2.h" define="MKE02Z16xxx2"/>
          <debug svd="SVD/MKE02Z2.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x4000" startup="1"   default="1"/>
          <memory id="IRAM1"                           start="0x1FFFFE00" size="0x0800" init   ="0"   default="1"/>
          <algorithm name="Flash/MKE02Zxxx_P16KB.FLM"  start="0x00000000" size="0x4000" RAMstart="0x1FFFFE00"  RAMsize="0x0800"  default="1"/>
          <algorithm name="Flash/MKE02Zxxx_EE256B.FLM" start="0x10000000" size="0x0100" RAMstart="0x1FFFFE00"  RAMsize="0x0800"  default="1"/>

          <book name="Documents/MKE02Z64M20SF0RM.pdf" title="MKE02Z16xxx2 Device Reference Manual"/>
          <book name="Documents/MKE02P64M20SF0.pdf"   title="MKE02Z16xxx2 Device Data Sheet"/>
        </device>

        <!-- ******************************  MKE02Z32xxx2  ****************************** -->
        <device Dname="MKE02Z32xxx2">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="20000000"/>
          <compile header="Device/Include/MKE02Z2.h" define="MKE02Z32xxx2"/>
          <debug svd="SVD/MKE02Z2.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x8000"     startup="1"   default="1"/>
          <memory id="IRAM1"                           start="0x1FFFFC00" size="0x1000"     init   ="0"   default="1"/>
          <algorithm name="Flash/MKE02Zxxx_P32KB.FLM"  start="0x00000000" size="0x8000" RAMstart="0x1FFFFC00"  RAMsize="0x1000"  default="1"/>
          <algorithm name="Flash/MKE02Zxxx_EE256B.FLM" start="0x10000000" size="0x0100" RAMstart="0x1FFFFC00"  RAMsize="0x1000"  default="1"/>

          <book name="Documents/MKE02Z64M20SF0RM.pdf" title="MKE02Z32xxx2 Device Reference Manual"/>
          <book name="Documents/MKE02P64M20SF0.pdf"   title="MKE02Z32xxx2 Device Data Sheet"/>
        </device>

        <!-- ******************************  MKE02Z64xxx2  ****************************** -->
        <device Dname="MKE02Z64xxx2">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="20000000"/>
          <compile header="Device/Include/MKE02Z2.h" define="MKE02Z64xxx2"/>
          <debug svd="SVD/MKE02Z2.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x10000"    startup="1"   default="1"/>
          <memory id="IRAM1"                           start="0x1FFFFC00" size="0x1000"     init   ="0"   default="1"/>
          <algorithm name="Flash/MKE02Zxxx_P64KB.FLM"  start="0x00000000" size="0x10000" RAMstart="0x1FFFFC00" RAMsize="0x1000"  default="1"/>
          <algorithm name="Flash/MKE02Zxxx_EE256B.FLM" start="0x10000000" size="0x00100" RAMstart="0x1FFFFC00" RAMsize="0x1000"  default="1"/>

          <book name="Documents/MKE02Z64M20SF0RM.pdf" title="MKE02Z64xxx2 Device Reference Manual"/>
          <book name="Documents/MKE02P64M20SF0.pdf"   title="MKE02Z64xxx2 Device Data Sheet"/>
        </device>

        <!-- ******************************  MKE02Z64xxx4  ****************************** -->
        <device Dname="MKE02Z64xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="40000000"/>
          <compile header="Device/Include/MKE02Z4.h" define="MKE02Z64xxx4"/>
          <debug svd="SVD/MKE02Z4.svd"/>
          <memory id="IROM1"                           start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory id="IRAM1"                           start="0x1FFFFC00"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm name="Flash/MKE02Zxxx_P64KB.FLM"  start="0x00000000" size="0x10000"  RAMstart="0x1FFFFC00"  RAMsize="0x1000"  default="1"/>
          <algorithm name="Flash/MKE02Zxxx_EE256B.FLM" start="0x10000000" size="0x0100"  RAMstart="0x1FFFFC00"  RAMsize="0x1000"  default="1"/>

          <book name="Documents/MKE02P64M40SF0RM.pdf" title="MKE02Z64xxx4 Device Reference Manual"/>
          <book name="Documents/MKE02P64M40SF0.pdf"   title="MKE02Z64xxx4 Device Data Sheet"/>
        </device>

        <!-- ******************************  MKE02Z32xxx4  ****************************** -->
        <device Dname="MKE02Z32xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="40000000"/>
          <compile header="Device/Include/MKE02Z4.h" define="MKE02Z32xxx4"/>
          <debug svd="SVD/MKE02Z4.svd"/>
          <memory id="IROM1"                           start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory id="IRAM1"                           start="0x1FFFFC00"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm name="Flash/MKE02Zxxx_P32KB.FLM"  start="0x00000000" size="0x8000"  RAMstart="0x1FFFFC00"  RAMsize="0x1000"  default="1"/>
          <algorithm name="Flash/MKE02Zxxx_EE256B.FLM" start="0x10000000" size="0x0100"  RAMstart="0x1FFFFC00"  RAMsize="0x1000"  default="1"/>

          <book name="Documents/MKE02P64M40SF0RM.pdf" title="MKE02Z64xxx4 Device Reference Manual"/>
          <book name="Documents/MKE02P64M40SF0.pdf"   title="MKE02Z64xxx4 Device Data Sheet"/>
        </device>

        <!-- ******************************  MKE02Z16xxx4  ****************************** -->
        <device Dname="MKE02Z16xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="40000000"/>
          <compile header="Device/Include/MKE02Z4.h" define="MKE02Z16xxx4"/>
          <debug svd="SVD/MKE02Z4.svd"/>
          <memory id="IROM1"                           start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory id="IRAM1"                           start="0x1FFFFE00"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm name="Flash/MKE02Zxxx_P16KB.FLM"  start="0x00000000" size="0x4000"  RAMstart="0x1FFFFE00"  RAMsize="0x0800"  default="1"/>
          <algorithm name="Flash/MKE02Zxxx_EE256B.FLM" start="0x10000000" size="0x0100"  RAMstart="0x1FFFFE00"  RAMsize="0x0800"  default="1"/>

          <book name="Documents/MKE02P64M40SF0RM.pdf" title="MKE02Z64xxx4 Device Reference Manual"/>
          <book name="Documents/MKE02P64M40SF0.pdf"   title="MKE02Z64xxx4 Device Data Sheet"/>
        </device>
      </subFamily>

      <!-- ******************************  KE04  ****************************** -->
      <subFamily DsubFamily="KE04">
        <processor Dcore="Cortex-M0+" DcoreVersion="r0p0"/>
        <book name="Documents/dui0662a_cortex_m0p_r0p0_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
        <description>
The Kinetis KE04 MCU family delivers a next-generation solution with enhanced ESD/EMC performance for cost-sensitive, high-reliability device applications used in high electrical noise environments.
 - Offers a cost-effective 32-bit solution featuring low power and high robustness.
 - Provides a pin-compatibility within the Kinetis E series portfolio, as well as pin compatibility with Freescale's 8-bit S08P family.
 - Includes a powerful array of analog, communication and timing, and control peripherals with varying flash memory size and pin count.
        </description>

        <!-- ******************************  MKE04Z8xxx4  ****************************** -->
        <device Dname="MKE04Z8xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/MKE04Z4.h" define="MKE04Z8xxx4"/>
          <debug svd="SVD/MKE04Z4.svd"/>
          <memory id="IROM1"                         start="0x00000000" size="0x2000"     startup="1"   default="1"/>
          <memory id="IRAM1"                         start="0x1FFFFF00" size="0x0400"     init   ="0"   default="1"/>
          <algorithm name="Flash/MKE04Zxxx_P8KB.FLM" start="0x00000000" size="0x2000"    RAMstart="0x1FFFFF00"  RAMsize="0x400"  default="1"/>

          <book name="Documents/MKE04P24M48SF0RM.pdf" title="MKE04Z8xxx4 Device Reference Manual"/>
          <book name="Documents/MKE04P24M48SF0.pdf"   title="MKE04Z8xxx4 Device Data Sheet"/>
        </device>

        <!-- ******************************  MKE04Z64xxx4  ****************************** -->
        <device Dname="MKE04Z64xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/MKE04Z1284.h" define="MKE04Z64xxx4"/>
          <debug svd="SVD/MKE04Z1284.svd"/>
          <memory id="IROM1"                          start="0x00000000" size="0x10000"    startup="1"   default="1"/>
          <memory id="IRAM1"                          start="0x1FFFF800" size="0x2000"     init   ="0"   default="1"/>
          <algorithm name="Flash/MKE04Zxxx_P64KB.FLM" start="0x00000000" size="0x10000"     RAMstart="0x20000000"  RAMsize="0x1000"  default="1"/>

          <book name="Documents/MKE04P80M48SF0RM.pdf" title="MKE04Z64xxx4 Device Reference Manual"/>
          <book name="Documents/MKE04P80M48SF0.pdf"   title="MKE04Z64xxx4 Device Data Sheet"/>
        </device>

        <!-- ******************************  MKE04Z64xxx4  ****************************** -->
        <device Dname="MKE04Z128xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/MKE04Z1284.h" define="MKE04Z128xxx4"/>
          <debug svd="SVD/MKE04Z1284.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x20000"    startup="1"   default="1"/>
          <memory id="IRAM1"                           start="0x1FFFF000" size="0x4000"     init   ="0"   default="1"/>
          <algorithm name="Flash/MKE04Zxxx_P128KB.FLM" start="0x00000000" size="0x20000"     RAMstart="0x20000000"  RAMsize="0x1000"  default="1"/>

          <book name="Documents/MKE04P80M48SF0RM.pdf" title="MKE04Z128xxx4 Device Reference Manual"/>
          <book name="Documents/MKE04P80M48SF0.pdf"   title="MKE04Z128xxx4 Device Data Sheet"/>
        </device>
      </subFamily>

