t21/Walnut_X/Packages/.cache/Keil.Kinetis_KExx_DFP.1.4.0.pdsc
      <!-- ******************************  KE06  ****************************** -->
      <subFamily DsubFamily="KE06">
        <processor Dcore="Cortex-M0+" DcoreVersion="r0p0"/>
        <book name="Documents/dui0662a_cortex_m0p_r0p0_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
        <description>
The Kinetis KE06 MCU family delivers a next-generation solution with enhanced ESD/EMC performance for cost-sensitive, high-reliability device applications used in high electrical noise environments.
 - Offers a cost-effective, entry-level 32-bit solution featuring low power and high robustness.
 - Provides a pin-compatibility within the Kinetis E series portfolio, as well as pin compatibility with Freescale's 8-bit S08P family.
 - Includes a powerful array of analog, communication and timing, and control peripherals with varying flash memory size and pin count.
        </description>

        <!-- ******************************  MKE06Z64xxx4  ****************************** -->
        <device Dname="MKE06Z64xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/MKE06Z4.h" define="MKE06Z64xxx4"/>
          <debug svd="SVD/MKE06Z4.svd"/>
          <memory id="IROM1"                          start="0x00000000" size="0x10000"    startup="1"   default="1"/>
          <memory id="IRAM1"                          start="0x1FFFF800" size="0x2000"     init   ="0"   default="1"/>
          <algorithm name="Flash/MKE06Zxxx_P64KB.FLM" start="0x00000000" size="0x10000"     RAMstart="0x20000000"  RAMsize="0x1000"  default="1"/>

          <book name="Documents/MKE06P80M48SF0RM.pdf" title="MKE06Z64xxx4 Device Reference Manual"/>
          <book name="Documents/MKE06P80M48SF0.pdf"   title="MKE06Z64xxx4 Device Data Sheet"/>
        </device>

        <!-- ******************************  MKE06Z128xxx4  ****************************** -->
        <device Dname="MKE06Z128xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/MKE06Z4.h" define="MKE06Z128xxx4"/>
          <debug svd="SVD/MKE06Z4.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x20000"    startup="1"   default="1"/>
          <memory id="IRAM1"                           start="0x1FFFF000" size="0x4000"     init   ="0"   default="1"/>
          <algorithm name="Flash/MKE06Zxxx_P128KB.FLM" start="0x00000000" size="0x20000"     RAMstart="0x20000000"  RAMsize="0x1000"  default="1"/>

          <book name="Documents/MKE06P80M48SF0RM.pdf" title="MKE06Z128xxx4 Device Reference Manual"/>
          <book name="Documents/MKE06P80M48SF0.pdf"   title="MKE06Z128xxx4 Device Data Sheet"/>
        </device>
      </subFamily>

      <!-- ******************************  KE1x  ****************************** -->
      <subFamily DsubFamily="KE1x">
        <processor Dcore="Cortex-M0+" DcoreVersion="r0p0"/>
        <book name="Documents/dui0662a_cortex_m0p_r0p0_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
        <description>
The Kinetis KE1x MCU family is brand new ...
        </description>

        <!-- ******************************  MKE14Z128xxx7  ****************************** -->
        <device Dname="MKE14Z128xxx7">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
          <compile header="Device/Include/MKE14Z7.h" define="MKE14Z128xxx7"/>
          <debug svd="SVD/MKE14Z7.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x20000" startup="1" default="1"/>
          <memory id="IROM2"                             start="0x10000000" size="0x08000" startup="0" default="0"/>
          <memory id="IRAM1"                             start="0x1FFFF000" size="0x04000" init   ="0" default="1"/>
          <algorithm name="Flash/MKE1x_P256_2KB_SEC.FLM" start="0x00000000" size="0x20000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>
          <algorithm name="Flash/MKE1x_D32_2KB_SEC.FLM"  start="0x10000000" size="0x08000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>

          <!--book name="Documents/KE1xZP100M72SF0RM.pdf" title="MKE14Z128xxx7 Device Reference Manual"/-->
          <!--book name="Documents/KE1xZP100M72SF0.pdf"   title="MKE14Z128xxx7 Device Data Sheet"/-->
        </device>

        <!-- ******************************  MKE14Z256xxx7  ****************************** -->
        <device Dname="MKE14Z256xxx7">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
          <compile header="Device/Include/MKE14Z7.h" define="MKE14Z256xxx7"/>
          <debug svd="SVD/MKE14Z7.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x40000" startup="1" default="1"/>
          <memory id="IROM2"                             start="0x10000000" size="0x08000" startup="0" default="0"/>
          <memory id="IRAM1"                             start="0x1FFFE000" size="0x08000" init   ="0" default="1"/>
          <algorithm name="Flash/MKE1x_P256_2KB_SEC.FLM" start="0x00000000" size="0x40000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>
          <algorithm name="Flash/MKE1x_D32_2KB_SEC.FLM"  start="0x10000000" size="0x08000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>

          <!--book name="Documents/KE1xZP100M72SF0RM.pdf" title="MKE14Z256xxx7 Device Reference Manual"/-->
          <!--book name="Documents/KE1xZP100M72SF0.pdf"   title="MKE14Z256xxx7 Device Data Sheet"/-->
        </device>

        <!-- ******************************  MKE15Z128xxx7  ****************************** -->
        <device Dname="MKE15Z128xxx7">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
          <compile header="Device/Include/MKE15Z7.h" define="MKE15Z128xxx7"/>
          <debug svd="SVD/MKE15Z7.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x20000" startup="1" default="1"/>
          <memory id="IROM2"                             start="0x10000000" size="0x08000" startup="0" default="0"/>
          <memory id="IRAM1"                             start="0x1FFFF000" size="0x04000" init   ="0" default="1"/>
          <algorithm name="Flash/MKE1x_P256_2KB_SEC.FLM" start="0x00000000" size="0x20000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>
          <algorithm name="Flash/MKE1x_D32_2KB_SEC.FLM"  start="0x10000000" size="0x08000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>

          <!--book name="Documents/KE1xZP100M72SF0RM.pdf" title="MKE15Z128xxx7 Device Reference Manual"/-->
          <!--book name="Documents/KE1xZP100M72SF0.pdf"   title="MKE15Z128xxx7 Device Data Sheet"/-->
        </device>

        <!-- ******************************  MKE15Z256xxx7  ****************************** -->
        <device Dname="MKE15Z256xxx7">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
          <compile header="Device/Include/MKE15Z7.h" define="MKE15Z256xxx7"/>
          <debug svd="SVD/MKE15Z7.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x40000" startup="1" default="1"/>
          <memory id="IROM2"                             start="0x10000000" size="0x08000" startup="0" default="0"/>
          <memory id="IRAM1"                             start="0x1FFFE000" size="0x08000" init   ="0" default="1"/>
          <algorithm name="Flash/MKE1x_P256_2KB_SEC.FLM" start="0x00000000" size="0x40000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>
          <algorithm name="Flash/MKE1x_D32_2KB_SEC.FLM"  start="0x10000000" size="0x08000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>

          <!--book name="Documents/KE1xZP100M72SF0RM.pdf" title="MKE15Z256xxx7 Device Reference Manual"/-->
          <!--book name="Documents/KE1xZP100M72SF0.pdf"   title="MKE15Z256xxx7 Device Data Sheet"/-->
        </device>
      </subFamily>

