t21/Walnut_X/Packages/.cache/Keil.Kinetis_KExx_DFP.1.4.0.pdsc
      <!-- ******************************  KE1xF  ****************************** -->
      <subFamily DsubFamily="KE1xF">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="160000000"/>
        <book name="Documents/dui0553a_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
        <!--book name="Documents/MKE18F512_RM.pdf" title="Kinetis KE1xF Sub-Family Reference Manual"/-->
        <description>
The Kinetis KE1xF MCU family is brand new ...
        </description>

        <!-- ******************************  MKE14F256xxx16  ****************************** -->
        <device Dname="MKE14F256xxx16">
          <compile header="Device/Include/MKE14F16.h" define="MKE14F256xxx16"/>
          <debug svd="SVD/MKE14F16.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IROM2"                             start="0x10000000" size="0x00008000" startup="0" default="0"/>
          <memory id="IRAM1"                             start="0x1FFFC000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/MKE1x_P256_4KB_SEC.FLM" start="0x00000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>
          <algorithm name="Flash/MKE1x_D32_2KB_SEC.FLM"  start="0x10000000" size="0x00008000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>

          <!--book name="Documents/MKE18F512.pdf"    title="Kinetis KE1xF Sub-Family Device Data Sheet"/-->
        </device>

        <!-- ******************************  MKE14F512xxx16  ****************************** -->
        <device Dname="MKE14F512xxx16">
          <compile header="Device/Include/MKE14F16.h" define="MKE14F512xxx16"/>
          <debug svd="SVD/MKE14F16.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IROM2"                             start="0x10000000" size="0x00010000" startup="0" default="0"/>
          <memory id="IRAM1"                             start="0x1FFF8000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash/MKE1x_P512_4KB_SEC.FLM" start="0x00000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>
          <algorithm name="Flash/MKE1x_D64_2KB_SEC.FLM"  start="0x10000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>

          <!--book name="Documents/MKE18F512.pdf"    title="Kinetis KE1xF Sub-Family Device Data Sheet"/-->
        </device>

        <!-- ******************************  MKE16F256xxx16  ****************************** -->
        <device Dname="MKE16F256xxx16">
          <compile header="Device/Include/MKE16F16.h" define="MKE16F256xxx16"/>
          <debug svd="SVD/MKE16F16.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IROM2"                             start="0x10000000" size="0x00008000" startup="0" default="0"/>
          <memory id="IRAM1"                             start="0x1FFFC000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/MKE1x_P256_4KB_SEC.FLM" start="0x00000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>
          <algorithm name="Flash/MKE1x_D32_2KB_SEC.FLM"  start="0x10000000" size="0x00008000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>

          <!--book name="Documents/MKE18F512.pdf"    title="Kinetis KE1xF Sub-Family Device Data Sheet"/-->
        </device>

        <!-- ******************************  MKE16F512xxx16  ****************************** -->
        <device Dname="MKE16F512xxx16">
          <compile header="Device/Include/MKE16F16.h" define="MKE16F512xxx16"/>
          <debug svd="SVD/MKE16F16.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IROM2"                             start="0x10000000" size="0x00010000" startup="0" default="0"/>
          <memory id="IRAM1"                             start="0x1FFF8000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash/MKE1x_P512_4KB_SEC.FLM" start="0x00000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>
          <algorithm name="Flash/MKE1x_D64_2KB_SEC.FLM"  start="0x10000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>

          <!--book name="Documents/MKE18F512.pdf"    title="Kinetis KE1xF Sub-Family Device Data Sheet"/-->
        </device>

        <!-- ******************************  MKE18F256xxx16  ****************************** -->
        <device Dname="MKE18F256xxx16">
          <compile header="Device/Include/MKE18F16.h" define="MKE18F256xxx16"/>
          <debug svd="SVD/MKE18F16.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IROM2"                             start="0x10000000" size="0x00008000" startup="0" default="0"/>
          <memory id="IRAM1"                             start="0x1FFFC000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/MKE1x_P256_4KB_SEC.FLM" start="0x00000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>
          <algorithm name="Flash/MKE1x_D32_2KB_SEC.FLM"  start="0x10000000" size="0x00008000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>

          <!--book name="Documents/MKE18F512.pdf"    title="Kinetis KE1xF Sub-Family Device Data Sheet"/-->
        </device>

        <!-- ******************************  MKE14F512xxx16  ****************************** -->
        <device Dname="MKE18F512xxx16">
          <compile header="Device/Include/MKE18F16.h" define="MKE18F512xxx16"/>
          <debug svd="SVD/MKE18F16.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IROM2"                             start="0x10000000" size="0x00010000" startup="0" default="0"/>
          <memory id="IRAM1"                             start="0x1FFF8000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash/MKE1x_P512_4KB_SEC.FLM" start="0x00000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>
          <algorithm name="Flash/MKE1x_D64_2KB_SEC.FLM"  start="0x10000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>

          <!--book name="Documents/MKE18F512.pdf"    title="Kinetis KE1xF Sub-Family Device Data Sheet"/-->
        </device>
      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="KE02Z2 CMSIS">
      <description>Freescale Kinetis KE02 20MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKE02Z16xxx2"/>
      <accept Dname="MKE02Z32xxx2"/>
      <accept Dname="MKE02Z64xxx2"/>
    </condition>

    <condition id="KE02Z4 CMSIS">
      <description>Freescale Kinetis KE02 40MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKE02Z16xxx4"/>
      <accept Dname="MKE02Z32xxx4"/>
      <accept Dname="MKE02Z64xxx4"/>
    </condition>

