t21/Walnut_X/Packages/.cache/Keil.Kinetis_KExx_DFP.1.4.0.pdsc
    <condition id="KE04Z4 CMSIS">
      <description>Freescale Kinetis KE04 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKE04Z8xxx4"/>
      </condition>

    <condition id="KE04Z1284 CMSIS">
      <description>Freescale Kinetis KE04 64kB/128kB 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKE04Z64xxx4"/>
      <accept Dname="MKE04Z128xxx4"/>
    </condition>

    <condition id="KE06Z4 CMSIS">
      <description>Freescale Kinetis KE06 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKE06Z64xxx4"/>
      <accept Dname="MKE06Z128xxx4"/>
    </condition>

    <condition id="KE14Z7 CMSIS">
      <description>Freescale Kinetis KE14 72MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKE14Z128xxx7"/>
      <accept Dname="MKE14Z256xxx7"/>
    </condition>

    <condition id="KE15Z7 CMSIS">
      <description>Freescale Kinetis KE15 72MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKE15Z128xxx7"/>
      <accept Dname="MKE15Z256xxx7"/>
    </condition>

    <condition id="KE14F16 CMSIS">
      <description>Freescale Kinetis KE14F 160MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKE14F256xxx16"/>
      <accept Dname="MKE14F512xxx16"/>
    </condition>

    <condition id="KE16F16 CMSIS">
      <description>Freescale Kinetis KE16F 160MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKE16F256xxx16"/>
      <accept Dname="MKE16F512xxx16"/>
    </condition>

    <condition id="KE18F16 CMSIS">
      <description>Freescale Kinetis KE18F 160MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKE18F256xxx16"/>
      <accept Dname="MKE18F512xxx16"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup KE02Z2 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KE02Z2 CMSIS">
      <description>System Startup for Kinetis KE02 20MHz devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/Source/ARM/startup_MKE02Z2.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MKE02Z2.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup KE02Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KE02Z4 CMSIS">
      <description>System Startup for Kinetis KE02 40MHz devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/Source/ARM/startup_MKE02Z4.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MKE02Z4.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup KE04Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KE04Z4 CMSIS">
      <description>System Startup for Kinetis KE04 40MHz devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/Source/ARM/startup_MKE04Z4.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MKE04Z4.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup KE04Z1284 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KE04Z1284 CMSIS">
      <description>System Startup for Kinetis KE04 40MHz devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/Source/ARM/startup_MKE04Z1284.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MKE04Z1284.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup KE06Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KE06Z4 CMSIS">
      <description>System Startup for Kinetis KE04 40MHz devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/Source/ARM/startup_MKE06Z4.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MKE06Z4.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup KE14Z7 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="KE14Z7 CMSIS">
      <description>System Startup for Kinetis KE14 72MHz devices devices devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/Source/ARM/startup_MKE14Z7.s" attr="config" version="3.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MKE14Z7.c"      attr="config" version="3.0.0"/>
        <file category="header" name="Device/Source/system_MKE14Z7.h"      attr="config" version="3.0.0"/>
      </files>
    </component>

    <!-- Startup KE15Z7 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="KE15Z7 CMSIS">
      <description>System Startup for Kinetis KE15 72MHz devices devices devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/Source/ARM/startup_MKE15Z7.s" attr="config" version="3.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MKE15Z7.c"      attr="config" version="3.0.0"/>
        <file category="header" name="Device/Source/system_MKE15Z7.h"      attr="config" version="3.0.0"/>
      </files>
    </component>

    <!-- Startup KE14F16 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KE14F16 CMSIS">
      <description>System Startup for Kinetis KE14F 160MHz devices devices devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source" name="Device/Source/ARM/startup_MKE14F16.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MKE14F16.c"      attr="config" version="1.0.0"/>
        <file category="header" name="Device/Source/system_MKE14F16.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

