t21/Walnut_X/Packages/.cache/Keil.Kinetis_KExx_DFP.1.4.0.pdsc
    <!-- Startup KE16F16 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KE16F16 CMSIS">
      <description>System Startup for Kinetis KE16F 160MHz devices devices devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source" name="Device/Source/ARM/startup_MKE16F16.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MKE16F16.c"      attr="config" version="1.0.0"/>
        <file category="header" name="Device/Source/system_MKE16F16.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup KE18F16 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KE18F16 CMSIS">
      <description>System Startup for Kinetis KE18F 160MHz devices devices devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source" name="Device/Source/ARM/startup_MKE18F16.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MKE18F16.c"      attr="config" version="1.0.0"/>
        <file category="header" name="Device/Source/system_MKE18F16.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

  </components>

  <boards>
    <board name="FRDM-KE04Z" vendor="Freescale" revision="Rev. A" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>The FRDM-KE04Z is an ultra-low-cost development platform for Kinetis KE04 MCUs.</description>
      <book category="manual"    name="Documents/FRDM-KE04ZUG.pdf" title="Freedom KE04 User’s Guide"/>
      <mountedDevice    deviceIndex="0" Dvendor="Freescale:78" Dname="MKE04Z8xxx4"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dfamily="KExx Series" DsubFamily="KE04"/>
      <feature type="ODbg"           n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"            n="5"              name="USB Powered"/>
      <feature type="Button"         n="1"              name="Reset Button"/>
      <feature type="LED"            n="1"              name="Tri-color LED"/>
      <feature type="Accelerometer"  n="1"              name="MMA8451Q Accelerometer"/>
      <feature type="ContOther"      n="1"              name="Capacitive touch slider"/>
      <feature type="IrDA"           n="1"              name="IrDA transmitter and receiver"/>
    </board>

    <board name="FRDM-KE06Z" vendor="Freescale" revision="Rev. A" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>The FRDM-KE06Z is a simple, yet sophisticated development platform for Kinetis KE06 MCUs.</description>
      <book category="manual"    name="Documents/FRDMKE06UG.pdf" title="Freedom KE06 User’s Guide"/>
      <mountedDevice    deviceIndex="0" Dvendor="Freescale:78" Dname="MKE06Z128xxx4"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dfamily="KExx Series" DsubFamily="KE06"/>
      <feature type="ODbg"           n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"            n="5"              name="USB Powered"/>
      <feature type="Button"         n="1"              name="Reset Button"/>
      <feature type="LED"            n="1"              name="Tri-color LED"/>
      <feature type="Accelerometer"  n="1"              name="MMA8451Q Accelerometer"/>
      <feature type="CAN"            n="1"              name="CAN communication"/>
      <feature type="IrDA"           n="1"              name="IrDA transmitter and receiver"/>
    </board>
  </boards>

  <examples>
    <!-- FRDM-KE04Z Development Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/Freescale/FRDM-KE04Z/Blinky">
      <description>Blinky example</description>
      <board name="FRDM-KE04Z" vendor="Freescale" Dvendor="Freescale:78" Dname="MKE04Z8xxx4"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <!-- FRDM-KE06Z Development Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/Freescale/FRDM-KE06Z/Blinky">
      <description>Blinky example</description>
      <board name="FRDM-KE06Z" vendor="Freescale" Dvendor="Freescale:78" Dname="MKE06Z128xxx4"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/Freescale/FRDM-KE06Z/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="FRDM-KE06Z" vendor="Freescale" Dvendor="Freescale:78" Dname="MKE06Z128xxx4"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
